# ##################################################################################################
# ExceptionMgr.py - 예외 처리 모듈
# ##################################################################################################
# ══════════════════════════════════════════════════════════════════════════════════════════
# 외부모듈 영역
# ══════════════════════════════════════════════════════════════════════════════════════════
import sys                                  # 시스템 관련 정보 모듈(Built-in)
import traceback                            # 예외 관련 정보 모듈(Built-in)

import clipboard                            # 클립보드 관리 모듈(pip install clipboard)

import PyQt6.QtWidgets as QtWdg             # PyQt6 QtWidgets 모듈(pip install pyqt6)
import PyQt6.QtCore as QtCore               # PyQt6 QtCore 모듈(pip install pyqt6)
import PyQt6.QtGui as QtGui                 # PyQt6 QtGui 모듈(pip install pyqt6)

from ComMgr import Common as Com            # 공통 모듈(User)
# ══════════════════════════════════════════════════════════════════════════════════════════
# 사용자정의 클래스 영역
# ------------------------------------------------------------------------------------------
# Except        - 예외처리 클래스
# Inheritance   - None
# ══════════════════════════════════════════════════════════════════════════════════════════
class Except():
    # ======================================================================================
    # 전역상수 관리 - 필수영역(정적변수)
    # ======================================================================================
    # ——————————————————————————————————————————————————————————————————————————————
    # Const         - 전역상수 클래스
    # Inheritance   - None
    # ——————————————————————————————————————————————————————————————————————————————
    class Const():
        MODE_DEBUG      = 1             # 디버그(개발) 모드
        MODE_RELEASE    = 0             # 배포(완료) 모드
    # ======================================================================================
    # 전역클래스 관리 - 필수영역(사용자정의 보조클래스)
    # ======================================================================================
    # ——————————————————————————————————————————————————————————————————————————————
    # UserExcepts  - 사용자정의 예외 클래스 선언
    # Inheritance   - None
    # ——————————————————————————————————————————————————————————————————————————————
    class UserExcepts():
        class Ex_InValidFilename(Exception): pass   # 파일명 부적합 예외 클래스(예시)
    # ======================================================================================
    # 전역변수 관리 - 필수영역(정적변수)
    # ======================================================================================
    # --------------------------------------------------------------
    # 시스템정의 메시지 {시스템 클래스명 : 운영자 오류메시지}
    # 사용자정의 메시지 {사용자 클래스명 : 운영자 오류메시지}
    # --------------------------------------------------------------
    oUserExceptMsg = {
                        'ZeroDivisionError'     : '연산 오류가 발생하였습니다.(예시)',
                        'IndexError'            : '배열 오류가 발생하였습니다.(예시)',

                        'Ex_InValidFilename'    : '파일명이 유효하지 않습니다. 파일 명을 다시 입력하세요.(예시)'
                     }
    # --------------------------------------------------------------
    # 어플리케이션 개발 모드
    # --------------------------------------------------------------
    # MODE_DEBUG    : 디버그(개발) 모드
    # MODE_RELEASE  : 배포(완료) 모드
    # --------------------------------------------------------------
    Mode = None                         # 어플리케이션 모드
    # ——————————————————————————————————————————————————————————————————————————————
    # __init__  - 생성자(인스턴스변수 생성/초기화)
    # Args      - self : 객체 인스턴스
    # Return    - None
    # ——————————————————————————————————————————————————————————————————————————————
    def __init__(self) -> None:
        try:
            # ======================================================================================
            # 전역변수 관리 - 필수영역(인스턴스변수)
            # ======================================================================================
            pass
            # ======================================================================================
            # 부모객체 생성 - 필수영역(상속을 받은 경우 필수)
            # ======================================================================================
            # super().__init__()                      # 부모 클래스가 하나인 경우 부모 객체 생성
            # Parent1.__init__(self)                  # 부모 클래스가 두개 이상인 경우 부모 객체 생성
            # Parent2.__init__(self)                  # 부모 클래스가 두개 이상인 경우 부모 객체 생성
            # ======================================================================================
        except Exception as Ex:
            Except.DisplayException(None)       # 예외처리(콘솔)
    # ======================================================================================
    # 전역함수 관리 - 필수영역(정적함수)
    # ======================================================================================
    # ——————————————————————————————————————————————————————————————————————————————
    # SetMode   - 어플리케이션 개발 모드 지정(반드시 프로그램 진입점에서 호출)
    # Args      - Mode : MODE_DEBUG | MODE_RELEASE
    # Return    - None
    # ——————————————————————————————————————————————————————————————————————————————
    @staticmethod
    def SetMode(Mode:Const) -> None:
        try:
            Except.Mode = Mode
        except Exception as Ex:
            raise Ex                        # 예외 던지기
    # ——————————————————————————————————————————————————————————————————————————————
    # DisplayException  - 예외 메시지 출력
    # Args              - ParentForm(None | Form Object)
    #                     None          - 콘솔 프로그램 인 경우
    #                     Form Object   - 윈도우 프로그램 인 경우
    #                   - Ex    : 발생한 예외 객체
    #                   - Wait  : 예외 메시지 출력 후 정지 여부
    #                   - 콘솔 프로그램 인 경우에만 해당
    # Return            - None
    # ——————————————————————————————————————————————————————————————————————————————
    @staticmethod
    def DisplayException(ParentForm, Ex:Exception=None, Wait:bool=False) -> None:
        sErrClassName = None            # 발생한 예외 클래스 명(예외 키로 사용)

        sErrTitle = None                # 예외 타이틀
        sErrMsg = None                  # 예외 메시지
        sTagMsg = None                  # 태그 예외 메시지(예외에 대한 추가 설명 메시지)
        sAllErrMsg = None               # 출력 할 전체 메시지

        sExceptFormat = '\n{0}\n{1}\n{2}\n{3}\n{4}\n{5}\n{6}'    # 출력 할 메시지 형식
        nMaxMsgLen = 0                  # 가장 긴 메시지 길이

        try:
            # --------------------------------------------------------------
            # 발생한 예외 클래스 명 읽기
            # --------------------------------------------------------------
            sErrClassName = sys.exc_info()[0].__name__
            # --------------------------------------------------------------
            # 발생한 시스템/사용자정의 예외 메시지를 예외 Dict에서 찾기
            # --------------------------------------------------------------
            if (sErrClassName in Except.oUserExceptMsg) == False:
                if Except.Mode == Except.Const.MODE_DEBUG:
                    clipboard.copy(f"'{sErrClassName}'")

                    sTagMsg = '오류가 발생 하였습니다.\n' \
                              '오류 클래스 명을 클립보드에 복사 하였습니다.\n\n' \
                              '[사용자용 오류 메시지를 등록하세요.]'
                else:
                    clipboard.copy(f"Class Name : ['{sErrClassName}']\n\n{traceback.format_exc()}")

                    sTagMsg = '오류가 발생 하였습니다.\n' \
                              '오류 정보를 클립보드에 복사 하였습니다.\n' \
                              '메모장에 [Ctrl + V]로 붙여넣기 하고,\n\n' \
                              '[전산실로 문의 하세요.]'
            # --------------------------------------------------------------
            # 개발 모드 인 경우
            # --------------------------------------------------------------
            sErrTitle = '[User-Exception Message]'

            if Except.Mode == Except.Const.MODE_DEBUG:
                sErrTitle = '[Dev-Exception Message]'
                # --------------------------------------------------------------
                # 발생한 상세 예외 메시지 읽기
                # --------------------------------------------------------------
                sErrMsg = traceback.format_exc()
                
                if bool(sTagMsg) == False:
                    sTagMsg = '[오류가 발생 하였습니다.]'
            # --------------------------------------------------------------
            # 배포 모드 & 예외 Dict에 시스템/사용자정의 예외가 등록 된 경우
            # --------------------------------------------------------------
            elif bool(sTagMsg) == False:
                sErrMsg = Except.oUserExceptMsg[sErrClassName]
                sTagMsg = '[전산실로 문의 하세요.]'
            # --------------------------------------------------------------
            # 배포 모드 & 예외 Dict에 시스템/사용자정의 예외가 등록 안 된 경우
            # --------------------------------------------------------------
            else:
                sErrMsg = '죄송합니다.\n' \
                          '등록된 오류 메시지가 없습니다.'
            # --------------------------------------------------------------
            # 예외 메시지가 긴경우 메시지안에 '. '를 두줄로 처리
            # --------------------------------------------------------------
            sErrMsg = sErrMsg.replace('. ', '\n')   # 예외 메시지가 긴경우를 위해 처리
            # --------------------------------------------------------------
            # 가장 긴 예외 메시지 & 길이 구하기
            # --------------------------------------------------------------
            nMaxMsgLen = Com.GetLengthOfArray(f'{sErrTitle}\n{sErrMsg}\n{sTagMsg}'.strip().split('\n'))
            # --------------------------------------------------------------
            # 최종 예외 메시지 만들기
            # --------------------------------------------------------------
            sAllErrMsg = sExceptFormat.format('═'*nMaxMsgLen,
                                              f'{sErrTitle}'.center(nMaxMsgLen),
                                              '—'*nMaxMsgLen,
                                              sErrMsg.strip(),
                                              '—'*nMaxMsgLen,
                                              sTagMsg,
                                              '═'*nMaxMsgLen)
            # --------------------------------------------------------------
            # 콘솔/윈도우 상태에 따라 예외 메시지 출력
            # --------------------------------------------------------------
            if ParentForm != None:
                oMsgBox = QtWdg.QMessageBox(ParentForm)
                
                oMsgBox.setIcon(QtWdg.QMessageBox.Icon.Critical)
                oMsgBox.setWindowTitle('오류발생')
                oMsgBox.setText(sAllErrMsg)
                oMsgBox.setFont(QtGui.QFont('Consolas'))    # 'Gulimche', 'Consolas'
                oMsgBox.exec()
                
                # 동일 => QtWdg.QMessageBox.critical(ParentForm, '예외발생', sAllErrMsg)
            else:
                print(sAllErrMsg)

                if Wait:
                    Com.Wait(' Press Enter key to continue...')
            # --------------------------------------------------------------
        except Exception as Ex:
            print(traceback.format_exc())       # 예외처리(직접처리)
    # ======================================================================================
    # 전역함수 관리 - 필수영역(인스턴스함수)
    # ======================================================================================
    pass
# ══════════════════════════════════════════════════════════════════════════════════════════
# 테스트 영역
# ══════════════════════════════════════════════════════════════════════════════════════════
if __name__ == '__main__':
    import sys
    import traceback

    try:
        # --------------------------------------------------------------
        # 나누기 오류 발생
        # --------------------------------------------------------------
        def Test1():
            try:
                # Except.SetDevAndApplicationMode(Except.Const.MODE_DEBUG)
                Except.SetDevAndApplicationMode(Except.Const.MODE_RELEASE)

                i = 0
                i = 10 / i
            except Exception as Ex:
                Except.DisplayException(None) 
        # --------------------------------------------------------------
        # 윈도우 폼에서 사용자정의 예외 강제 발생
        # --------------------------------------------------------------
        class Form(QtWdg.QWidget):
            def __init__(self) -> None:
                super().__init__()
                
                self.setGeometry(500, 500, 200, 100)
                
                self.btn1 = QtWdg.QPushButton(self)
                self.btn1.setText('강제 예외 발생 시키기')
                self.btn1.clicked.connect(self.btn1_clicked)

            def btn1_clicked(self):
                try:
                    self.Calc()
                except Exception as Ex:
                    Except.DisplayException(self)

            def Calc(self):
                try:
                    #i = 0
                    #i = 10 / i
                    raise Except.UserExcepts.Ex_InValidFilename(
                        Except.oUserExceptMsg[Except.UserExcepts.Ex_InValidFilename.__name__])
                except Exception as Ex:
                    raise Ex

        def Test2():
            try:
                Except.SetMode(Except.Const.MODE_DEBUG)
                # Except.SetDevAndApplicationMode(Except.Const.MODE_RELEASE)
                
                oApp = QtWdg.QApplication(sys.argv)     # Qt6 Application 객체생성
                frm1 = Form()                           # Qt6 Application 객체 안에 폼 객체 생성

                frm1.show()                             # 폼 객체 활성화(보이기)
                hWnd = oApp.exec()                      # 메시지 대기열 진입(이벤트 발생 가능)
                sys.exit(hWnd)                          # 메모리 해제
            except Exception as Ex:
                raise Ex
        # --------------------------------------------------------------
        # Test1()
        # --------------------------------------------------------------
        Test2()
    except Exception as Ex:
        print(traceback.format_exc())
# ##################################################################################################
# <END>
# ##################################################################################################
